#Калькулятор простых арефметических действий
a = float(input("Введи первое число: "))
b = float(input("Введи второе число: "))
c = input("Введи знак операции (+, -, *, /, ^): ")

if c == '+':
    print(a, "+", b, "=", a + b)
elif c == '-':
    print(a, "-", b, "=", a - b)
elif c == '*':
    print(a, "*", b, "=", a * b)
elif c == '/':
    if b != 0:
        print(a, "/", b, "=", a / b)
    else:
        print("Ошибка: деление на ноль!")
elif c == '^':
    print(a, "^", b, "=", a ** b)
else:
    print("Ошибка: неизвестная операция")
input('нажми Enter, чтобы выйти...')